/**
 * @file ArrowRightIcon.tsx
 * @description 오른쪽으로 향하는 방향 아이콘 컴포넌트입니다.
 * 내 대시보드 페이지와 페이지네이션에서 사용합니다.
 *
 * SVGProps를 확장하여 width, height, className 등의 속성을 props로 전달받아
 * 아이콘의 크기와 스타일을 유연하게 제어할 수 있습니다.
 *
 * @example
 * <ArrowRightIcon width={20} height={20} />
 * <ArrowRightIcon className="w-5 h-5 text-gray" />
 */

import { SVGProps } from 'react';

export default function ArrowRightIcon(props: SVGProps<SVGSVGElement>) {
  return (
    <svg
      viewBox="0 0 20 20"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      {...props}
    >
      <path
        d="M12.359 9.99933L6.08176 3.72208C5.91616 3.55648 5.8355 3.35937 5.83976 3.13074C5.84404 2.90211 5.92898 2.705 6.09457 2.53941C6.26017 2.37381 6.45728 2.29102 6.68591 2.29102C6.91453 2.29102 7.11164 2.37381 7.27724 2.53941L13.6571 8.93204C13.8077 9.08268 13.9193 9.25147 13.992 9.43843C14.0646 9.62541 14.1009 9.81237 14.1009 9.99933C14.1009 10.1863 14.0646 10.3733 13.992 10.5602C13.9193 10.7472 13.8077 10.916 13.6571 11.0666L7.26443 17.4592C7.09883 17.6248 6.90385 17.7055 6.67949 17.7012C6.45514 17.697 6.26017 17.612 6.09457 17.4464C5.92898 17.2808 5.84618 17.0837 5.84618 16.8551C5.84618 16.6265 5.92898 16.4294 6.09457 16.2638L12.359 9.99933Z"
        fill="#333236"
      />
    </svg>
  );
}
