/**
 * @file ImageUploaderChip.tsx
 * @description 이미지 업로더의 기본 UI로 사용되는 컴포넌트입니다.
 * 할 일 카드와 계정 관리의 프로필 이미지 업로드에 사용됩니다.
 *
 * @example
 * ## 할 일 카드 > 이미지 👉 76
 * <ImageUploaderChip />
 *
 * ## 계정 관리 > 프로필 👉 182
 * <ImageUploaderChip size={182} />
 *
 * @author 수경
 */

interface Props {
  /**
   * 아이콘의 바탕(배경/<rect />) 사이즈를 제어합니다.
   * '+' 아이콘의 크기는 16.8로 고정입니다.
   * @default 76
   */
  size?: number;
}

export default function ImageUploaderChip({ size = 76 }: Props) {
  // '+' 아이콘 중앙 정렬을 위한 계산식입니다.
  const center = size / 2;
  const iconOffset = center - 38;

  return (
    <svg width={size} height={size} viewBox={`0 0 ${size} ${size}`}>
      {/* 배경 */}
      <rect width={size} height={size} rx="6" fill="#F5F5F5" />

      {/* 아이콘 (중앙 정렬 유지) */}
      <g transform={`translate(${iconOffset}, ${iconOffset})`}>
        <path
          d="M36.6729 39.3266H30.9233C30.5509 39.3266 30.2366 39.1985 29.9804 38.9424C29.7243 38.6862 29.5962 38.3719 29.5962 37.9995C29.5962 37.6271 29.7243 37.3128 29.9804 37.0567C30.2366 36.8005 30.5509 36.6724 30.9233 36.6724H36.6729V30.9228C36.6729 30.5504 36.801 30.2361 37.0572 29.9799C37.3133 29.7238 37.6276 29.5957 38 29.5957C38.3724 29.5957 38.6867 29.7238 38.9429 29.9799C39.199 30.2361 39.3271 30.5504 39.3271 30.9228V36.6724H45.0767C45.4491 36.6724 45.7634 36.8005 46.0196 37.0567C46.2758 37.3128 46.4038 37.6271 46.4038 37.9995C46.4038 38.3719 46.2758 38.6862 46.0196 38.9424C45.7634 39.1985 45.4491 39.3266 45.0767 39.3266H39.3271V45.0762C39.3271 45.4487 39.199 45.7629 38.9429 46.0191C38.6867 46.2753 38.3724 46.4033 38 46.4033C37.6276 46.4033 37.3133 46.2753 37.0572 46.0191C36.801 45.7629 36.6729 45.4487 36.6729 45.0762V39.3266Z"
          fill="#5534DA"
        />
      </g>
    </svg>
  );
}
